Revit 2024 API
FabricationConfiguration.HasValidConfiguration Method
 Checks whether a valid fabrication configuration has been set for the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool HasValidConfiguration()
Visual Basic
Public Function HasValidConfiguration As Boolean
Visual C++
public:
bool HasValidConfiguration()
Return Value
 True if a valid fabrication configuration has been set for the project.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace